Revit 2017 API
LoadNatureCategory Enumeration
 Specifies load case nature.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Since: 2016
Syntax
C#
[ObsoleteAttribute("This enum is obsolete in Revit 2017. Use LoadCaseCategory instead.")]
public enum LoadNatureCategory
Visual Basic
<ObsoleteAttribute("This enum is obsolete in Revit 2017. Use LoadCaseCategory instead.")> _
Public Enumeration LoadNatureCategory
Visual C++
[ObsoleteAttribute(L"This enum is obsolete in Revit 2017. Use LoadCaseCategory instead.")]
public enum class LoadNatureCategory
Members
Member name | Description
Dead |  Dead
Live |  Live
Wind |  Wind
Snow |  Snow
RoofLive |  Roof Live
Accidental |  Accidental
Temperature |  Temperature
Seismic |  Seismic
See Also
Autodesk.Revit.DB.Structure Namespace